04-convergence.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Convergence and Level-Triggering</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="content">
<h1 class="title">Convergence and Level-Triggering</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8b1d241">1. <span class="todo INPROGRESS">INPROGRESS</span> Declarativity: what, not how</a></li>
<li><a href="#org57d4353">2. <span class="todo TODO">TODO</span> Convergence</a></li>
<li><a href="#org3dcb5c1">3. <span class="todo TODO">TODO</span> Level-triggering</a></li>
</ul>
</div>
</div>
<p>
While this book is largely focused on operators as a pattern for
building systems on Kubernetes, it's worth keeping in mind that the
basic ideas here don't have much to do with Kubernetes at all. In this
chapter we'll take a step back from the pragmatic and get a little
more grounding in the theory behind the practice. We'll swing back
around to the "real thing" soon enough, newly armed with a deeper
understand of the fundamentals. The key concepts are <b>declarativity</b>,
<b>convergence</b>, and <b>level-triggering</b>. Maybe these are already
familiar to you, or perhaps you have more of a practical bias; if
that's the case, don't hesitate to skip forward. This chapter stands
alone, and you can always come back to it.
</p>

<div id="outline-container-org8b1d241" class="outline-2">
<h2 id="org8b1d241"><span class="section-number-2">1</span> <span class="todo INPROGRESS">INPROGRESS</span> Declarativity: what, not how</h2>
<div class="outline-text-2" id="text-1">
<p>
If you've been around programming circles for a while, there's a good
chance you're already familiar with the the idea of "declarativity",
and declarative vs. imperative. Declarative is about "what", and
imperative is about "how", right? It's the difference between the
elegance of mergesort in Haskell and the mechanical grind (and the
beauty!) of Timsort in C. In the world of operators, declarativity is
of supreme importance
</p>
</div>
</div>

<div id="outline-container-org57d4353" class="outline-2">
<h2 id="org57d4353"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Convergence</h2>
</div>

<div id="outline-container-org3dcb5c1" class="outline-2">
<h2 id="org3dcb5c1"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Level-triggering</h2>
</div>
</div>
</body>
</html>
